###############################################################################################
###############################################################################################
#####    ROC.R                                                                            #####
#####    Cusomer Relationship Analytics                                                   #####
###############################################################################################
#####    Technische Hochschule Nürnberg                                                   #####
#####    Fakultät Informatik                                                              #####
###############################################################################################
#####    Prof. Dr. Rainer Groß                                                            #####
#####    Julian Knoll (M.A.)                                                              #####
###############################################################################################
###############################################################################################
##### Skript zur Erstellung einer ROC-Kurve

iSize=10

vResult=c(2,4,7)

FPR=((sort(vResult)-(1:length(vResult)))/(iSize-length(vResult)))
FPR=c(0,FPR,1)

TPR=(1:length(vResult))/length(vResult)
TPR=c(0,TPR,1)


plot(FPR,TPR,ty="s",xlim=c(0,1),ylim=c(0,1),main="ROC curve")
lines(c(0,1),c(0,1),ty="l",lty=2)

sum(diff(FPR[-1])*TPR[-c(1,length(TPR))])

if(length(FPR)<10) cbind(FPR,TPR)


